# -*- coding: utf-8 -*-
# 统计几天内CPC总消费额度
import time, MySQLdb, os
from pychartdir import *

#result = open('result.txt','w')

#频道类型
sq = ['175    东城', '179    丰台', '182    大兴', '178    宣武', '186    密云', '177    崇文', '189    平谷', '188    延庆', '187    怀柔', '181    房山', '185    昌平', '174    朝阳', '173    海淀', '3283    燕郊', '180    石景山', '176    西城', '183    通州', '190    门头沟', '184    顺义']
jd = ['7116    万寿寺',  '176    万寿路',  '144    万柳',  '7117    万泉河',  '131    上地',  '7118    世纪城',  '793    中关村',  '7119    二里庄',  '7120    五棵松',  '139    五道口',  '7121    交通大学',  '7122    人民大学',  '178    公主坟',  '800    其他',  '7123    军博',  '7124    北大清华',  '156    北太平庄',  '7674    北洼路',  '154    双榆树',  '148    四季青',  '7675    增光路',  '7672    大钟寺',  '794    学院路',  '7125    定慧寺',  '7126    小营',  '606    永定路',  '128    清河',  '7127    牡丹园',  '171    甘家口',  '7128    田村',  '7129    白石桥',  '7130    皂君庙',  '7131    知春路',  '164    紫竹桥',  '168    航天桥',  '7132    花园桥',  '620    苏州街',  '7133    蓟门桥',  '135    西三旗',  '7134    西二旗',  '611    西北旺',  '7135    西直门',  '7136    西苑',  '7673    车道沟',  '7137    香山',  '7138    马甸',  '133    马连洼',  '160    魏公村',  '7139    CBD',  '213    三元桥',  '622    三里屯',  '637    东坝',  '7140    东大桥',  '196    亚运村',  '7141    健翔桥',  '236    八里庄',  '802    其他',  '252    劲松',  '7142    北沙滩',  '7143    北苑',  '631    十八里店',  '7144    十里堡',  '8917    华威桥',  '7677    南磨房',  '254    双井',  '7376    双桥',  '625    呼家楼',  '205    和平街',  '7145    四惠',  '226    团结湖',  '211    国展',  '239    国贸',  '257    垡头',  '193    大屯',  '7146    大山子',  '217    太阳宫',  '198    奥运村',  '7676    姚家园',  '8918    安慧桥',  '202    安贞',  '7147    定福庄',  '200    小关',  '630    小红门',  '7148    小营',  '796    工体',  '215    左家庄',  '246    常营',  '8916    建外大街',  '7149    惠新里',  '184    望京',  '224    朝外',  '7150    朝阳公园',  '232    朝青板块',  '182    来广营',  '7151    柳芳',  '650    水碓子',  '250    潘家园',  '219    燕莎',  '7152    甘露园',  '7153    甜水园',  '7154    百子湾',  '7155    石佛营',  '248    管庄',  '234    红庙',  '7156    芍药居',  '186    花家地',  '209    西坝河',  '7157    西大望路',  '632    豆各庄',  '188    酒仙桥',  '243    高碑店',  '284    东单',  '282    东四',  '270    东四十条',  '267    东直门',  '272    交道口',  '804    其他',  '265    北新桥',  '259    和平里',  '261    安定门',  '286    建国门',  '274    景山',  '277    朝阳门',  '7158    沙滩',  '7159    海运仓',  '7160    灯市口',  '279    王府井',  '263    雍和宫',  '7161    三里河',  '296    什刹海',  '7162    六铺炕',  '806    其他',  '310    南礼士路',  '7163    后海',  '7164    复兴门',  '7165    官园',  '7166    小西天',  '303    展览路',  '292    德胜门',  '290    新街口',  '308    月坛',  '7167    木樨地',  '7168    百万庄',  '659    积水潭',  '320    西便门',  '316    西单',  '318    西四',  '288    西直门',  '7169    车公庄',  '314    金融街',  '305    阜成门',  '329    体育馆路',  '7170    光明楼',  '808    其他',  '322    前门',  '326    天坛',  '7171    崇文门',  '7172    广渠门',  '336    永定门',  '7173    沙子口',  '331    法华寺',  '7174    花市',  '333    龙潭湖',  '810    其他',  '7175    前门',  '7176    南菜园',  '7177    右安门',  '342    和平门',  '356    天桥',  '340    宣武门',  '348    广安门',  '350    牛街',  '7678    白广路',  '358    白纸坊',  '7178    红莲',  '352    菜市口',  '354    虎坊桥',  '7179    西客站',  '338    长椿街',  '361    陶然亭',  '674    马连道',  '7681    七里庄',  '401    世界公园',  '7683    东高地',  '7180    丰台体育馆',  '394    丰台路',  '7181    丽泽桥',  '7679    云岗',  '7682    五里店',  '7182    六里桥',  '812    其他',  '7183    刘家窑',  '7184    北大地',  '678    南苑',  '391    卢沟桥',  '399    右安门',  '7684    和义',  '7680    嘉园',  '386    大红门',  '7185    宋家庄',  '7186    岳各庄',  '7187    左安门',  '7188    成寿寺',  '7189    新发地',  '371    方庄',  '7190    木樨园',  '7191    洋桥',  '376    玉泉营',  '681    科技园区',  '682    花乡',  '7192    草桥',  '7193    菜户营',  '7194    蒲黄榆',  '7195    西客站',  '383    西罗园',  '7196    角门',  '7197    赵公口',  '389    长辛店',  '7198    青塔',  '379    马家堡',  '7199    马连道',  '686    五里坨',  '7686    八大处',  '7685    八宝山',  '412    八角',  '814    其他',  '410    古城',  '685    广宁',  '7200    杨庄',  '7201    模式口',  '7202    玉泉路',  '416    老山',  '407    苹果园',  '7203    衙门口',  '7204    西山',  '405    金顶街',  '414    鲁谷',  '816    其他',  '7205    房山城关',  '424    窦店',  '422    良乡',  '426    迎风',  '428    长阳',  '430    阎村',  '432    韩村河',  '444    亦庄',  '818    其他',  '791    庞各庄',  '442    旧宫',  '440    西红门',  '438    黄村',  '718    临河里',  '7206    乔庄',  '7207    九棵树',  '820    其他',  '7208    北关环岛',  '458    北苑',  '7209    土桥',  '7210    新华大街',  '7211    果园',  '462    梨园',  '7212    梨园城铁',  '7213    武夷花园',  '464    潞城',  '469    玉桥',  '473    马驹桥',  '484    仁和',  '480    光明',  '822    其他',  '726    南彩',  '475    后沙峪',  '488    天竺',  '7214    新国展',  '7215    机场',  '798    李桥',  '486    杨镇',  '482    石园',  '478    胜利',  '722    马坡',  '746    兴寿',  '824    其他',  '500    北七家',  '742    十三陵',  '738    南口',  '744    南邵',  '493    回龙观',  '736    城北',  '737    城南',  '502    天通苑',  '498    小汤山',  '749    昌平县城',  '797    沙河镇',  '747    百善',  '504    立水桥',  '743    长陵',  '741    阳坊',  '7216    霍营',  '739    马池口',  '495    龙泽',  '518    不老屯',  '826    其他',  '510    北庄',  '508    十里堡',  '516    古北口',  '512    太师屯',  '506    密云',  '514    新城子',  '520    溪翁庄',  '522    穆家峪',  '540    九渡河',  '828    其他',  '534    北房',  '526    庙城',  '536    怀北',  '530    怀柔',  '532    杨宋',  '542    桥梓',  '544    汤河口',  '524    泉河',  '538    渤海镇',  '528    雁栖',  '550    八达岭',  '830    其他',  '552    大榆树',  '548    康庄',  '546    延庆',  '554    永宁',  '570    东高村',  '558    兴谷',  '832    其他',  '574    刘家店',  '562    峪口',  '566    平谷镇',  '560    渔阳',  '556    滨河',  '580    熊儿寨',  '576    王辛庄',  '564    金海湖',  '572    镇罗营',  '568    马昌营',  '578    黄松峪',  '586    东辛房',  '834    其他',  '592    军庄',  '584    城子街道',  '582    大峪',  '596    妙峰山',  '590    永定',  '598    清水',  '594    潭柘寺',  '588    龙泉']
arr = [1,3,5,6,7,8,9]
dic = {}
sum = 0
timeNow = int(time.time())
dateNow = time.strftime('%Y-%m-%d',time.localtime(timeNow))
dayNow = time.strftime('%H:%M:%S',time.localtime(timeNow))
day = dateNow[8:10]
month = dateNow[5:7]
year = dateNow[0:4]
conn=MySQLdb.connect(host="192.168.116.20",user="lixueshi",passwd="i14p4Dkyd",port=3810,db="house_cpc",charset="utf8")
#conn2=MySQLdb.connect(host="192.168.116.20",user="lixueshi",passwd="i14p4Dkyd",port=3320,db="gcrm",charset="utf8")
cursor = conn.cursor()
#cursor2 = conn2.cursor()
for houseType in arr:
    sql = 'SELECT location_type, location_id, SUBSTR(FROM_UNIXTIME(click_time), 9, 2), SUBSTR(FROM_UNIXTIME(click_time), 12, 2), COUNT(1), AVG(cpc_price), SUM(real_price) FROM house_click_record_12_'+str(houseType)+' WHERE STATUS=1 AND click_time>=UNIX_TIMESTAMP(\''+dateNow+'\') - '+str(86400*7)+' AND click_time<=UNIX_TIMESTAMP(\''+dateNow+'\') GROUP BY location_type,location_id,account_id, SUBSTR(FROM_UNIXTIME(click_time), 9, 2), SUBSTR(FROM_UNIXTIME(click_time), 12, 2)'
    #连接
    #sql='SELECT location_type, SUBSTR(FROM_UNIXTIME(click_time), 9, 2), account_id, COUNT(1), AVG(cpc_price), SUM(real_price) FROM house_click_record_12_1 WHERE STATUS=1 AND click_time>=UNIX_TIMESTAMP(\''+dateNow+'\') - '+str(86400*7)+' AND click_time<=UNIX_TIMESTAMP(\''+dateNow+'\') GROUP BY location_type, SUBSTR(FROM_UNIXTIME(click_time), 9, 2),account_id'
    #print sql
    cursor.execute(sql)
    for row in cursor.fetchall()[:10]:
        lType=row[0]
        lId = row[1]
        if 1 == lType:
            

'''for ele in dic:
    result.write(ele+'\t'+str(dic[ele]['clicks'])+'\t'+str(dic[ele]['real_price'])+'\n')
result.close()'''